read_verilog control_decoder.v
read_verilog forwarding_unit.v
read_verilog alu_decoder.v
synth_ecp5 -json hardware.json
stat
show -width -signed -stretch -long -colors 28061389