read_verilog execute_phase.v

synth

dfflibmap -liberty sky.lib
abc -D 5000 -liberty sky.lib
opt_clean
stat -liberty sky.lib

write_verilog netlist.v
write_json netlist.json
